tutorials/compressible/rhoSimpleFoam/ras/kOmegaSSTCC/uDuct/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 0.000765;

boundaryField
{
    ".*Walls.*"
    {
        type            compressible::epsilonWallFunction;
        value           uniform 0;
    }
    inlet
    {
        type fixedValue;
        value uniform 0.000765;
    }
    outlet
    {
        type inletOutlet;
        inletValue uniform 0.000765;
    }
    frontAndBackPlanes
    {
        type empty;
    }
}


// ************************************************************************* //
