tutorials/compressible/rhoSimpleFoam/ras/kOmegaSSTCC/uDuct/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    ".*Walls.*"
    {
        type            zeroGradient;
    }
    outlet
    {
        type fixedValue;
        value uniform 101325;
    }
    /*
    inlet
    {
        type totalPressure;
        p0          121590;
        rho         none;
        phi         phi;
        psi         psi;
        U           U;
        gamma       1.4;
    }
    */
    inlet
    {
        type zeroGradient;
    }
    frontAndBackPlanes
    {
        type empty;
    }
}

// ************************************************************************* //
