tutorials/compressible/rhoSimpleFoam/ras/kOmegaSSTCC/uDuct/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPoint;

setFormat       raw;

sets
(
    y0CC210
    {
        type    uniform;
        axis    x;
        start   ( -0.0572 0 0 );
        end     ( -0.0191 0 0 );
        nPoints 100;
    }
);

fields          ( U p );

// ************************************************************************* //
